MYiR-Dev/myir-imx-linux/drivers/staging/rtl8733bu/core/rtw_mlme_ext.c
			#ifdef CONFIG_AP_MODE
			if (psta->state & WIFI_STA_ALIVE_CHK_STATE) {
				RTW_INFO("%s alive check - rx ADDBA response\n", __func__);
				psta->htpriv.agg_enable_bitmap &= ~BIT(tid);
				psta->expire_to = pstapriv->expire_to;
				psta->state ^= WIFI_STA_ALIVE_CHK_STATE;
			}
			#endif

			/* RTW_INFO("marc: ADDBA RSP: %x\n", pmlmeinfo->agg_enable_bitmap); */
			break;

		case RTW_WLAN_ACTION_DELBA: /* DELBA */
			if ((frame_body[3] & BIT(3)) == 0) {
				psta->htpriv.agg_enable_bitmap &= ~(1 << ((frame_body[3] >> 4) & 0xf));
				psta->htpriv.candidate_tid_bitmap &= ~(1 << ((frame_body[3] >> 4) & 0xf));

				/* reason_code = frame_body[4] | (frame_body[5] << 8); */
				reason_code = RTW_GET_LE16(&frame_body[4]);
			} else if ((frame_body[3] & BIT(3)) == BIT(3)) {
				tid = (frame_body[3] >> 4) & 0x0F;

				preorder_ctrl = &psta->recvreorder_ctrl[tid];
				preorder_ctrl->enable = _FALSE;
				preorder_ctrl->ampdu_size = RX_AMPDU_SIZE_INVALID;
			}

			RTW_INFO("%s(): DELBA: %x(%x)\n", __FUNCTION__, pmlmeinfo->agg_enable_bitmap, reason_code);
			/* todo: how to notify the host while receiving DELETE BA */
			break;

		default:
			break;
		}
	}
#endif /* CONFIG_80211N_HT */
	return _SUCCESS;
}

#ifdef CONFIG_APPEND_VENDOR_IE_ENABLE
u32 rtw_build_vendor_ie(_adapter *padapter , unsigned char **pframe , u8 mgmt_frame_tyte)
{
	int vendor_ie_num = 0;
	struct mlme_priv *pmlmepriv = &(padapter->mlmepriv);
	u32 len = 0;

	for (vendor_ie_num = 0 ; vendor_ie_num < WLAN_MAX_VENDOR_IE_NUM ; vendor_ie_num++) {
		if (pmlmepriv->vendor_ielen[vendor_ie_num] > 0 && pmlmepriv->vendor_ie_mask[vendor_ie_num] & mgmt_frame_tyte) {
			_rtw_memcpy(*pframe , pmlmepriv->vendor_ie[vendor_ie_num] , pmlmepriv->vendor_ielen[vendor_ie_num]);
			*pframe +=  pmlmepriv->vendor_ielen[vendor_ie_num];
			len += pmlmepriv->vendor_ielen[vendor_ie_num];
		}
	}

	return len;
}
#endif

#ifdef CONFIG_GO_APPEND_COUNTRY_IE
u8 *rtw_set_channel_triplet(struct rtw_chset *chset, u8 *buf_pos, u8 *trip_len, char alpha2[2])
{
	u8 i = 0;
	u8 fch = 0, lch = 0, ch;
	u8 *cont = buf_pos + 5;
	RT_CHANNEL_INFO *chinfo;

	while (i < chset->chs_len) {
		chinfo = &chset->chs[i++];

		if (chinfo->flags & RTW_CHF_DIS)
			continue;

		ch = chinfo->ChannelNum;

		if (fch == 0) {
			fch = ch;
			lch = ch;
			continue;
		}

		if (lch + 1 != ch) {
			*cont = fch;
			*(cont + 1) = lch - fch + 1;
			*(cont + 2) = 128;
			cont += 3;
			fch = ch;
		}
		lch = ch;
	}

	if (fch) {
		/* last subband */
		*cont = fch;
		*(cont + 1) = lch - fch + 1;
		*(cont + 2) = 128;
		cont += 3;
	}

	if (cont > buf_pos + 5) {
		*trip_len += (cont - buf_pos - 2);
		*buf_pos = WLAN_EID_COUNTRY;
		*(buf_pos + 1) = cont - buf_pos - 2;
		*(buf_pos + 2) = alpha2[0];
		*(buf_pos + 3) = alpha2[1];
		*(buf_pos + 4) = ' ';
		return cont;
	}
	return buf_pos;
}

u8 rtw_set_ie_country(_adapter *adapter, u8 *pframe, u32 *pkt_len)
{
	struct rf_ctl_t *rfctl = adapter_to_rfctl(adapter);
	u8 *p = NULL, *dst_ie = NULL, *remainder_ie = NULL, *backup_remainder_ie = NULL;
	u32 offset = 0, tmp_len = 0;
	s32 remainder_ielen = 0;
	u8 trip_len = 0, country_ie_len = 0;

	/* calculate head_len */
	offset = _FIXED_IE_LENGTH_;

	/* get ssid_ie len */
	p = rtw_get_ie(pframe + _BEACON_IE_OFFSET_, _SSID_IE_, &tmp_len, (*pkt_len - _BEACON_IE_OFFSET_));
	if (p != NULL)
		offset += tmp_len + 2;

	/* get supported rates len */
	p = rtw_get_ie(pframe + _BEACON_IE_OFFSET_, _SUPPORTEDRATES_IE_, &tmp_len, (*pkt_len - _BEACON_IE_OFFSET_));
	if (p !=  NULL)
		offset += tmp_len + 2;

	/* DS Parameter Set IE, len=3 */
	offset += 3;

	/* get TIM IE len */
	p = rtw_get_ie(pframe + _BEACON_IE_OFFSET_, _TIM_IE_, &tmp_len, (*pkt_len - _BEACON_IE_OFFSET_));
	if (p !=  NULL)
		offset += tmp_len + 2;

	remainder_ie = pframe + offset;
	remainder_ielen = (*pkt_len - sizeof(struct rtw_ieee80211_hdr_3addr)) - offset;

	dst_ie = pframe + offset;

	if (remainder_ielen > 0) {
		backup_remainder_ie = rtw_malloc(remainder_ielen);
		if (backup_remainder_ie && remainder_ie)
			_rtw_memcpy(backup_remainder_ie, remainder_ie, remainder_ielen);
	}

	dst_ie = rtw_set_channel_triplet(&rfctl->chset, dst_ie, &trip_len, rfctl->alpha2);

	/* size of country IE */
	country_ie_len = trip_len + 2;

	if (backup_remainder_ie) {
		_rtw_memcpy(dst_ie, backup_remainder_ie, remainder_ielen);

		rtw_mfree(backup_remainder_ie, remainder_ielen);
	}

	*pkt_len += country_ie_len;

	return country_ie_len;
}
#endif

#ifdef CONFIG_P2P
int get_reg_classes_full_count(struct p2p_channels *channel_list)
{
	int cnt = 0;
	int i;

	for (i = 0; i < channel_list->reg_classes; i++)
		cnt += channel_list->reg_class[i].channels;

	return cnt;
}

void issue_p2p_GO_request(_adapter *padapter, u8 *raddr)
{
	struct p2p_channels *ch_list = &(adapter_to_rfctl(padapter)->channel_list);
	unsigned char category = RTW_WLAN_CATEGORY_PUBLIC;
	u8			action = P2P_PUB_ACTION_ACTION;
	u32			p2poui = cpu_to_be32(P2POUI);
	u8			oui_subtype = P2P_GO_NEGO_REQ;
	u8			*wpsie = NULL, *p2pie = NULL;
	u8			wpsielen = 0, p2pielen = 0;
	u16			len_channellist_attr = 0;
#ifdef CONFIG_WFD
	u32					wfdielen = 0;
#endif

	struct xmit_frame			*pmgntframe;
	struct pkt_attrib			*pattrib;
	unsigned char					*pframe;
	struct rtw_ieee80211_hdr	*pwlanhdr;
	unsigned short				*fctrl;
	struct xmit_priv			*pxmitpriv = &(padapter->xmitpriv);
	struct mlme_ext_priv	*pmlmeext = &(padapter->mlmeextpriv);
	struct wifidirect_info	*pwdinfo = &(padapter->wdinfo);


	wpsie = (u8 *)rtw_zmalloc(255);
	if (!wpsie)
		return;
	p2pie = (u8 *)rtw_zmalloc(255);
	if (!p2pie)
		goto exit;

	pmgntframe = alloc_mgtxmitframe(pxmitpriv);
	if (pmgntframe == NULL)
		goto exit;

	RTW_INFO("[%s] In\n", __FUNCTION__);
	/* update attribute */
	pattrib = &pmgntframe->attrib;
	update_mgntframe_attrib(padapter, pattrib);

	_rtw_memset(pmgntframe->buf_addr, 0, WLANHDR_OFFSET + TXDESC_OFFSET);

	pframe = (u8 *)(pmgntframe->buf_addr) + TXDESC_OFFSET;
	pwlanhdr = (struct rtw_ieee80211_hdr *)pframe;

	fctrl = &(pwlanhdr->frame_ctl);
	*(fctrl) = 0;

	_rtw_memcpy(pwlanhdr->addr1, raddr, ETH_ALEN);
	_rtw_memcpy(pwlanhdr->addr2, adapter_mac_addr(padapter), ETH_ALEN);
	_rtw_memcpy(pwlanhdr->addr3, adapter_mac_addr(padapter), ETH_ALEN);

	SetSeqNum(pwlanhdr, pmlmeext->mgnt_seq);
	pmlmeext->mgnt_seq++;
	set_frame_sub_type(pframe, WIFI_ACTION);

