MYiR-Dev/myir-imx-linux/drivers/staging/rtl8733bu/core/rtw_mlme_ext.c
		if (check_fwstate(&(iface->mlmepriv), WIFI_CSA_UPDATE_BEACON)) {
			clr_fwstate(&(iface->mlmepriv), WIFI_CSA_UPDATE_BEACON);
			RTW_INFO(FUNC_ADPT_FMT" wait beacon timeout, clear state "
				"WIFI_CSA_UPDATE_BEACON\n", FUNC_ADPT_ARG(iface));
			return;
		}
	}

	if (rfctl->csa_ch == 0) {
		RTW_INFO("channel switch done\n");
		return ;
	}

	/* switch channel after count down */
	if (rtw_set_csa_cmd(padapter, need_discon) != _SUCCESS) {
		reset_all_ecsa_param(padapter);
	}
}
#endif /* CONFIG_ECSA */

u8 set_csa_hdl(_adapter *adapter, unsigned char *pbuf)
{
#ifdef CONFIG_ECSA
	struct rf_ctl_t *rfctl = adapter_to_rfctl(adapter);
	struct ecsa_control_param *param;

	if (!pbuf)
		return H2C_PARAMETERS_ERROR;

	if (rfctl->csa_ch) {
		param = (struct ecsa_control_param*)pbuf;
		rtw_csa_switch_hdl(adapter_to_dvobj(adapter), param->need_disconnect);
	}
#endif
	return H2C_SUCCESS;
}

u8 set_ap_csa_hdl(_adapter *adapter, unsigned char *pbuf)
{
#if defined(CONFIG_AP_MODE) && defined(CONFIG_ECSA)
	struct dvobj_priv *dvobj = adapter_to_dvobj(adapter);
	u8 ifbmp_m = rtw_mi_get_ap_mesh_ifbmp(adapter);
	u8 enable = 1;
	int i;
	_adapter *iface;

	for (i = 0; i < dvobj->iface_nums; i++) {
		iface = dvobj->padapters[i];
		if (!iface || !(ifbmp_m & BIT(iface->iface_id)))
			continue;
		RTW_INFO("%s, HW_VAR_BCN_EARLY_C2H_RPT enable=%d\n", __FUNCTION__, enable);
		rtw_hal_set_hwreg(iface, HW_VAR_BCN_EARLY_C2H_RPT, &enable);
	}
#endif
	return H2C_SUCCESS;
}

u8 bcn_control_hdl(_adapter *adapter, unsigned char *pbuf)
{
#ifdef CONFIG_AP_MODE
	struct bcn_control_param *param;

	if (!pbuf)
		return H2C_PARAMETERS_ERROR;

	param = (struct bcn_control_param*)pbuf;
	if (param->control == 0)
		StopTxBeacon(adapter);
	else
		ResumeTxBeacon(adapter);
#endif
	return H2C_SUCCESS;
}

void rtw_update_mlme(_adapter *adapter, u8 *frame, u32 frame_len)
{
	unsigned int i;
	PNDIS_802_11_VARIABLE_IEs pIE;

	for (i = 0; i < frame_len;) {
		pIE = (PNDIS_802_11_VARIABLE_IEs)(frame + i);

		switch (pIE->ElementID) {
		case _VENDOR_SPECIFIC_IE_:
			if (_rtw_memcmp(pIE->data, WMM_PARA_OUI, 6))	/* WMM */
				WMM_param_handler(adapter, pIE);
#if defined(CONFIG_P2P) && defined(CONFIG_WFD)
			else if (_rtw_memcmp(pIE->data, WFD_OUI, 4))		/* WFD */
				rtw_process_wfd_ie(adapter, (u8 *)pIE, pIE->Length, __func__);
#endif
			break;

		case _HT_CAPABILITY_IE_:	/* HT caps */
			HT_caps_handler(adapter, pIE);
			#ifdef ROKU_PRIVATE
			HT_caps_handler_infra_ap(adapter, pIE);
			#endif /* ROKU_PRIVATE */
			break;

		case _HT_EXTRA_INFO_IE_:	/* HT info */
			HT_info_handler(adapter, pIE);
			break;

#ifdef CONFIG_80211AC_VHT
		case EID_VHTCapability:
			VHT_caps_handler(adapter, pIE);
			#ifdef ROKU_PRIVATE
			VHT_caps_handler_infra_ap(adapter, pIE);
			#endif /* ROKU_PRIVATE */
			break;

		case EID_VHTOperation:
			VHT_operation_handler(adapter, pIE);
			break;
#endif /* CONFIG_80211AC_VHT */

		case _ERPINFO_IE_:
			ERP_IE_handler(adapter, pIE);
			break;

#ifdef CONFIG_TDLS
		case WLAN_EID_EXT_CAP:
			if (check_ap_tdls_prohibited(pIE->data, pIE->Length) == _TRUE)
				adapter->tdlsinfo.ap_prohibited = _TRUE;
			if (check_ap_tdls_ch_switching_prohibited(pIE->data, pIE->Length) == _TRUE)
				adapter->tdlsinfo.ch_switch_prohibited = _TRUE;
			break;
#endif /* CONFIG_TDLS */

#ifdef CONFIG_RTW_80211K
		case _EID_RRM_EN_CAP_IE_:
			RM_IE_handler(adapter, pIE);
			break;
#endif

#ifdef ROKU_PRIVATE
		/* Infra mode, used to store AP's info , Parse the supported rates from AssocRsp */
		case _SUPPORTEDRATES_IE_:
			Supported_rate_infra_ap(adapter, pIE);
			break;

		case _EXT_SUPPORTEDRATES_IE_:
			Extended_Supported_rate_infra_ap(adapter, pIE);
			break;
#endif /* ROKU_PRIVATE */
		default:
			break;
		}

		i += (pIE->Length + 2);
	}
}

/* Reference from OnAssocRsp() */
static void rtw_csa_parse_beacon_ie(_adapter *adapter)
{
	WLAN_BSSID_EX *cur_network = &(adapter->mlmepriv.cur_network.network);
	u8 *bcn_ie = cur_network->IEs + _BEACON_IE_OFFSET_;
	u32 bcn_len = cur_network->IELength - _BEACON_IE_OFFSET_;

	rtw_update_mlme(adapter, bcn_ie, bcn_len);
}

/* Reference from rtw_joinbss_update_stainfo() and update_sta_info() */
static void rtw_csa_sta_update_stainfo(_adapter *adapter, struct sta_info *psta)
{
	struct mlme_ext_priv *pmlmeext = &(adapter->mlmeextpriv);
	struct mlme_ext_info *pmlmeinfo = &(pmlmeext->mlmext_info);
	struct mlme_priv *pmlmepriv = &(adapter->mlmepriv);
	WLAN_BSSID_EX *cur_network = &(adapter->mlmepriv.cur_network.network);

	update_wireless_mode(adapter);
	psta->wireless_mode = pmlmeext->cur_wireless_mode;
	rtw_hal_update_sta_wset(adapter, psta);

	/* update supported rate */
	psta->bssratelen = rtw_get_rateset_len(cur_network->SupportedRates);
	_rtw_memcpy(psta->bssrateset, cur_network->SupportedRates, psta->bssratelen);

	/* update supported MCS set */
	#ifdef CONFIG_80211N_HT
	if (pmlmepriv->htpriv.ht_option) {
		psta->htpriv.ht_option = _TRUE;
		_rtw_memcpy(psta->htpriv.ht_cap.supp_mcs_set,
				pmlmeinfo->HT_caps.u.HT_cap_element.MCS_rate, 16);
	} else {
		psta->htpriv.ht_option = _FALSE;
		_rtw_memset(&(psta->htpriv), 0, sizeof(struct ht_priv));
	}
	#endif

	/* update all VHT IEs includes VHT supported MCS set */
	#ifdef CONFIG_80211AC_VHT
	if (pmlmepriv->vhtpriv.vht_option) {
		psta->vhtpriv.vht_option = _TRUE;
		_rtw_memcpy(&psta->vhtpriv, &pmlmepriv->vhtpriv, sizeof(struct vht_priv));
	} else {
		psta->vhtpriv.vht_option = _FALSE;
		_rtw_memset(&(psta->vhtpriv), 0, sizeof(struct vht_priv));
	}
	psta->cmn.ra_info.is_vht_enable = psta->vhtpriv.vht_option;
	#endif

	rtw_hal_update_sta_ra_info(adapter, psta);

	psta->cmn.bw_mode = pmlmeext->cur_bwmode;
	#ifdef CONFIG_80211N_HT
	psta->htpriv.ch_offset = pmlmeext->cur_ch_offset;
	#endif
}

u8 rtw_csa_sta_update_cap_hdl(_adapter *adapter, unsigned char *pbuf)
{
	struct sta_info *psta = NULL;
	struct mlme_priv *pmlmepriv = &(adapter->mlmepriv);
	struct mlme_ext_info *pmlmeinfo = &(adapter->mlmeextpriv.mlmext_info);
	struct beacon_keys *cur_beacon = &(pmlmepriv->cur_beacon_keys);

	RTW_INFO(FUNC_ADPT_FMT"\n", FUNC_ADPT_ARG(adapter));
	psta = rtw_get_stainfo(&adapter->stapriv, get_bssid(&adapter->mlmepriv));
	if (psta == NULL) {
		RTW_ERR("CSA : "FUNC_ADPT_FMT", update sta_info fail\n",
				FUNC_ADPT_ARG(adapter));
		return H2C_SUCCESS;
	}

	#ifdef CONFIG_80211N_HT
	if (cur_beacon->proto_cap & PROTO_CAP_11N) {
		pmlmepriv->htpriv.ht_option = _TRUE;
		pmlmeinfo->HT_enable = _TRUE;
	} else {
		pmlmepriv->htpriv.ht_option = _FALSE;
		pmlmeinfo->HT_enable = _FALSE;
	}
	#endif

